<template>
  <div class="contentBox">
    <div @click="CLOSECONTENT" class="close">&times;</div>
    <div class="scroll-content" ref="scrollContent">
      <div class="scroll">
        <div class="marginBox" v-html="htmlData">
        </div>
      </div>
    </div>
  </div>
</template>

<script type="text/ecmascript-6">
//    import BScroll from "better-scroll"
    import { mapState,mapMutations } from 'vuex'
    export default {
      data () {
        return {
            lawData : `<h4>南屋北舍服务协议</h4>
          <h3>【首部及导言】</h3>
          <p>欢迎您选择并使用南屋北舍的服务！</p>
          <p><b>使用南屋北舍的服务前，您应当阅读并遵守《南屋北舍服务协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、管辖与法律适用条款，以及开通或使用某项服务的单独协议。限制、免责条款以黑体加粗或加下划线的形式提示您重点注意。除非您已阅读并接受本协议所有条款，否则您无权使用南屋北舍提供的服务。您使用南屋北舍的服务即视为您已阅读并同意本协议的约束。</b></p>
          <p><b>如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。</b></p>
          <h1>一、【协议的范围】</h1>
          <p>1.1 本协议是您与南屋北舍之间关于用户使用南屋北舍相关服务所订立的协议。“南屋北舍”是指南屋北舍运营方——杭州南屋北舍网络科技有限公司及其相关服务对应的运营关联单位。“用户”是指使用南屋北舍相关服务的使用人，在本协议中更多地称为“您”。</p>
          <p>1.2 本协议项下的服务是指南屋北舍向用户提供的包括但不限于网络媒体、互联网增值、互动娱乐、电子商务和广告等产品及服务（以下简称“本服务”）。</p>
          <p>1.3 您在使用南屋北舍某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”）。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。您对前述任何业务规则、单独协议的接受，即视为您对本协议全部的接受。</p>
          <h1>二、【用户个人信息保护】</h1>
          <p><b>2.1 保护用户个人信息是南屋北舍的一项基本原则。您同意南屋北舍将按照本协议的规定收集、使用、储存或分享您的个人信息。</b></p>
          <p>2.2 您在注册账号或使用本服务的过程中，可能需要填写一些必要的信息。若国家、地方法律法规有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则无法使用本服务或在使用过程中受到限制。</p>
          <p><b>2.3 南屋北舍特别提醒您应妥善保管您的个人信息。因您保管不善导致的注册信息被盗，责任由您自行承担。</b></p>
          <p>2.4 南屋北舍将运用各种现有安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。</p>
          <p><b>2.5 南屋北舍不会将您的个人信息转移或披露给任何非关联的第三方，除非：</b></p>
          <p><b>（1）相关法律法规或法院、政府机关要求；</b></p>
          <p><b>（2）为完成合并、分立、收购或资产转让而转移；或</b></p>
          <p><b>（3）为提供您要求的服务所必需。</b></p>
          <p><b>2.6 南屋北舍非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用南屋北舍的服务前，应事先取得您家长或法定监护人（以下简称"监护人"）的书面同意。</b></p>
          <h1>三、【使用本服务的方式】</h1>
          <p>3.1 除非您与南屋北舍另有约定，您同意本服务仅为您个人非商业性质的使用。</p>
          <p>3.2 您应当通过南屋北舍提供或认可的方式使用本服务。您依本协议条款所取得的权利不可转让。</p>
          <p>3.3 您不得使用未经南屋北舍授权的插件、外挂或第三方工具对本协议项下的服务进行干扰、破坏、修改或施加其他影响。</p>
          <h1>四、【按现状提供服务】</h1>
          <p><b>您理解并同意</b>，南屋北舍的服务是按照现有技术和条件所能达到的现状提供的。南屋北舍会尽最大努力向您提供服务，确保服务的连贯性和安全性；<b>但南屋北舍不能随时预见和防范法律、技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。</b></p>
          <h1>五、【自备设备】</h1>
          <p><b>5.1 您应当理解，您使用南屋北舍的服务需自行准备与相关服务有关的终端设备（如电脑、调制解调器等装置），并承担所需的费用（如电话费、上网费等费用）。</b></p>
          <p><b>5.2 您理解并同意，您使用本服务时会耗用您的终端设备和带宽等资源。</b></p>
          <h1>六、【广告】</h1>
          <p>6.1 您同意南屋北舍可以在提供服务的过程中自行或由第三方广告商向您发送广告、推广或宣传信息（包括商业与非商业信息），其方式和范围可不经向您特别通知而变更。</p>
          <p>6.2 南屋北舍可能为您提供选择关闭广告信息的功能，但任何时候您都不得以本协议未明确约定或南屋北舍未书面许可的方式屏蔽、过滤广告信息。</p>
          <p>6.3 南屋北舍依照法律的规定对广告商履行相关义务，您应当自行判断广告信息的真实性并为自己的判断行为负责，<b>除法律明确规定外，您因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，南屋北舍不承担责任。</b></p>
          <h1>七、【收费服务】</h1>
          <p>7.1 南屋北舍的部分服务是以收费方式提供的，如您使用收费服务，请遵守相关的协议。</p>
          <p>7.2 南屋北舍可能根据实际需要对收费服务的收费标准、方式进行修改和变更，南屋北舍也可能会对部分免费服务开始收费。如果您不同意南屋北舍修改、变更或付费内容，则应停止使用该服务。</p>
          <h1>八、【第三方提供的产品或服务】</h1>
          <p>您在南屋北舍平台上使用第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议。南屋北舍和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。</p>
          <p>如因第三方提供的产品或服务引发任何纠纷，包括您对于产品服务质量、内容、提供方式等方面存在任何不满或争议，均由您与该第三方协商处理，并由该第三方负责解决，南屋北舍不承担责任。</p>
          <p>第三方提供的产品或服务，相关的价格、数量、库存、服务标准或承诺等信息，随时都有可能发生变动，由于众所周知的互联网技术因素等客观原因存在，网页显示的信息可能会有一定的滞后性或差错，南屋北舍不作特别通知，对此情形您知悉并理解。</p>
          <p>您在使用南屋北舍平台上使用第三方提供的产品或服务时，需要提交必要的信息（包括但不限于姓名、手机号、地址、邮编、服务要求等），您知悉并确认，提交的信息与本人实际信息或个人真实意愿一致。如因提交的信息有误导致您收到的产品或接受的服务不能符合您的预期，相关责任由您自行承担。</p>
          <h1>九、【知识产权声明】</h1>
          <p>9.1 南屋北舍在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权归南屋北舍所有。</p>
          <p>9.2 除另有特别声明外，南屋北舍提供本服务时所依托软件的著作权、专利权及其他知识产权均归南屋北舍所有。</p>
          <p>9.3 上述及其他任何本服务包含的内容的知识产权均受到法律保护，未经南屋北舍或相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。</p>
          <h1>十、【用户违法行为】</h1>
          <p>10.1 您在使用本服务时须遵守法律法规，不得利用本服务从事违法违规行为，包括但不限于：</p>
          <p>（1）发布、传送、传播、储存危害国家安全统一、破坏社会稳定、违反公序良俗、侮辱、诽谤、淫秽、暴力以及任何违反国家法律法规的内容；</p>
          <p>（2）发布、传送、传播、储存侵害他人知识产权、商业秘密等合法权利的内容；</p>
          <p>（3）恶意虚构事实、隐瞒真相以误导、欺骗他人；</p>
          <p>（4）发布、传送、传播广告信息及垃圾信息；</p>
          <p>（5）其他法律法规禁止的行为。</p>
          <p>10.2 如果您违反了本条约定，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制裁措施，并要求南屋北舍给予协助；<b>造成损害的，您应依法予以赔偿，南屋北舍不承担任何责任。</b></p>
          <p>10.3 如果南屋北舍发现或收到他人举报您发布的信息违反本条约定，南屋北舍有权进行独立判断并采取技术手段予以删除、屏蔽或断开链接。同时，南屋北舍有权视用户的行为性质，采取包括但不限于暂停或终止服务、追究法律责任等措施。</p>
          <p><b>10.4 您违反本条约定，导致任何第三方损害的，您应当独立承担责任；南屋北舍因此遭受损失的，您也应当一并赔偿。</b></p>
          <h1>十一、【遵守当地法律监管】</h1>
          <p>11.1 您在使用本服务过程中应当遵守当地相关的法律法规，并尊重当地的道德和风俗习惯。<b>如果您的行为违反了当地法律法规或道德风俗，您应当为此独立承担责任。</b></p>
          <p>11.2 您应避免因使用本服务而使南屋北舍卷入政治和公共事件，否则南屋北舍有权暂停或终止对您的服务。</p>
          <h1>十二、【用户发送、传播的内容与第三方投诉处理】</h1>
          <p><b>12.1 您通过本服务发送或传播的内容（包括但不限于网页、文字、图片、音频、视频、图表等）均由您自行承担责任。</b></p>
          <p><b>12.2 您发送或传播的内容应有合法来源，相关内容为您所有或您已获得权利人的授权。</b></p>
          <p><b>12.3 您同意南屋北舍可为履行本协议或提供本服务的目的而使用您发送或传播的内容。</b></p>
          <p><b>12.4 如果南屋北舍收到权利人通知，主张您发送或传播的内容侵犯其相关权利的，您同意南屋北舍有权进行独立判断并采取删除、屏蔽或断开链接等措施。</b></p>
          <p><b>12.5 您使用本服务时不得违反国家法律法规、侵害他人合法权益。您理解并同意，如您被他人投诉侵权或您投诉他人侵权，南屋北舍有权将争议中相关方的主体、联系方式、投诉相关内容等必要信息提供给其他争议方或相关部门，以便及时解决投诉纠纷，保护他人合法权益。</b></p>
          <h1>十三、【不可抗力及其他免责事由】</h1>
          <p><b>13.1 您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免，且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等，以及社会事件如战争、动乱、政府行为等。出现上述情况时，南屋北舍将努力在第一时间与相关单位配合，及时进行修复，但是由此给您造成的损失，南屋北舍在法律允许的范围内免责。</b></p>
          <p><b>13.2 在法律允许的范围内，南屋北舍对以下情形导致的服务中断或受阻不承担责任：</b></p>
          <p><b>（1）受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；</b></p>
          <p><b>（2）用户或南屋北舍的电脑软件、系统、硬件和通信线路出现故障；</b></p>
          <p><b>（3）用户操作不当；</b></p>
          <p><b>（4）用户通过非南屋北舍授权的方式使用本服务；</b></p>
          <p><b>（5）其他南屋北舍无法控制或合理预见的情形。</b></p>
          <p><b>13.3 您理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，南屋北舍不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：</b></p>
          <p><b>（1）来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；</b></p>
          <p><b>（2）因使用本协议项下的服务，遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失；</b></p>
          <p><b>（3）其他因网络信息或用户行为引起的风险。</b></p>
          <p><b>13.4 您理解并同意，本服务并非为某些特定目的而设计，包括但不限于核设施、军事用途、医疗设施、交通通讯等重要领域。如果因为软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等，南屋北舍不承担法律责任。</b></p>
          <p><b>13.5 南屋北舍依据本协议约定获得处理违法违规内容的权利，该权利不构成南屋北舍的义务或承诺，南屋北舍不能保证及时发现违法行为或进行相应处理。</b></p>
          <p><b>13.6 在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意南屋北舍有关防范诈骗犯罪的提示。</b></p>
          <h1>十四、【协议的生效与变更】</h1>
          <p><b>14.1 您使用南屋北舍的服务即视为您已阅读本协议并接受本协议的约束。</b></p>
          <p>14.2 南屋北舍有权在必要时修改本协议条款。您可以在相关服务页面查阅最新版本的协议条款。</p>
          <p>14.3 本协议条款变更后，如果您继续使用南屋北舍提供的软件或服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用南屋北舍提供的软件或服务。</p>
          <h1>十五、【服务的变更、中断、终止】</h1>
          <p>15.1 南屋北舍可能会对服务内容进行变更，也可能会中断、中止或终止服务。</p>
          <p><b>15.2 您理解并同意，南屋北舍有权自主决定经营策略。在南屋北舍发生合并、分立、收购、资产转让时，南屋北舍可向第三方转让本服务下相关资产；南屋北舍也可在单方通知您后，将本协议下部分或全部服务转交由第三方运营或履行。具体受让主体以南屋北舍通知的为准</b></p>
          <p><b>15.3 如发生下列任何一种情形，南屋北舍有权不经通知而中断或终止向您提供的服务：</b></p>
          <p><b>（1）根据法律规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；</b></p>
          <p><b>（2）您违反相关法律法规或本协议的约定；</b></p>
          <p><b>（3）按照法律规定或主管部门的要求；</b></p>
          <p><b>（4）出于安全的原因或其他必要的情形。</b></p>
          <p>15.4 南屋北舍有权按本协议8.2条的约定进行收费。若您未按时足额付费，南屋北舍有权中断、中止或终止提供服务。</p>
          <p><b>15.5 您有责任自行备份存储在本服务中的数据。如果您的服务被终止，南屋北舍可以从服务器上永久地删除您的数据,但法律法规另有规定的除外。服务终止后，南屋北舍没有义务向您返还数据。</b></p>
          <h1>　十六、【管辖与法律适用】</h1>
          <p><b>16.1 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国法律（不包括冲突法）。</b></p>
          <p><b>16.2 本协议签订地为中华人民共和国浙江省杭州市江干区。</b></p>
          <p><b>16.3 若您和南屋北舍之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权即中国浙江省杭州市江干区人民法院管辖。</b></p>
          <p>16.4 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
          <p>16.5 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>
          <h1>十七、【未成年人使用条款】</h1>
          <p>17.1 若用户未满18周岁，则为未成年人，应在监护人监护、指导下阅读本协议和使用本服务。</p>
          <p>17.2 未成年人用户涉世未深，容易被网络虚象迷惑，且好奇心强，遇事缺乏随机应变的处理能力，很容易被别有用心的人利用而又缺乏自我保护能力。因此，未成年人用户在使用本服务时应注意以下事项，提高安全意识，加强自我保护：</p>
          <p>（1）认清网络世界与现实世界的区别，避免沉迷于网络，影响日常的学习生活；</p>
          <p>（2）填写个人资料时，加强个人保护意识，以免不良分子对个人生活造成骚扰；</p>
          <p>（3）在监护人或老师的指导下，学习正确使用网络；</p>
          <p>（4）避免陌生网友随意会面或参与联谊活动，以免不法分子有机可乘，危及自身安全。</p>
          <p>17.3 监护人、学校均应对未成年人使用本服务时多做引导。特别是家长应关心子女的成长，注意与子女的沟通，指导子女上网应该注意的安全问题，防患于未然。</p>
          <h1>十八、【其他】</h1>
          <p>如果您对本协议或本服务有意见或建议，可与南屋北舍联系，我们会给予您必要的帮助。</p>
          <p style="text-indent: 1.5em">（正文完）</p>
          <p style="text-align: right;margin-top: 20px">南屋北舍</p>`,
            protocolData : `<div class="item">
                <h1>尊敬的用户：</h1>
                <p>在接受本协议之前，请您仔细阅读本协议的全部内容。如果您不同意本协议的任意内容，请不要进行后续操作。</p>
            </div>
            <div class="item">
                <h1>南屋北舍试用申请协议</h1>
                <p style="text-indent: 0">（最近修订日期：2016年7月1日 ）</p>
            </div>
            <div class="item">
                <h1>第一条 签约主体</h1>
                <p>本协议由申请试用的南屋北舍用户（以下称为“您”）与杭州南屋北舍网络科技有限公司（以下称为“南屋北舍”）共同签署。</p>
            </div>
            <div class="item">
                <h1>第二条 协议成立与生效</h1>
                <p><b>2.1 您通过网络页面点击确认或在南屋北舍试用中心页面点击“提交申请”（或点击其他表示接受的按钮），即代表您已充分阅读、理解并同意本协议内容，本协议即时生效。</b></p>
                <p>2.2 本协议内容包括协议正文及所有南屋北舍已经发布或后续发布并采取合理途径提前七个自然日通知您的与试用申请相关的规则。前述规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。</p>
                <p><b>2.3 南屋北舍可根据需要不时地制订、修改本协议及/或与试用申请相关的规则，并以网站公示的方式进行公告，不再单独通知您。变更后的协议和规则在南屋北舍网站公布之日起七个自然日后，即自动生效。如您不同意相关变更，应当立即停止试用申请。您继续进行任何试用申请，即表示您接受经修订的协议和规则。</b></p>
            </div>
            <div class="item">
                <h1>第三条 定义</h1>
                <p>3.1 南屋北舍：杭州南屋北舍网络有限公司的简称。</p>
                <p>3.2 试用品：由南屋北舍试用中心向南屋北舍用户提供的实物产品或线下体验服务。</p>
            </div>
            <div class="item">
                <h1>第四条 申请试用</h1>
                <p>4.1 南屋北舍在试用中心发布试用品信息，并设置试用品数量。<b>因服务器时间差、系统自动审核申请者是否具备领用条件需要一定的时间等原因，您所看到的试用品数量与您最终是否成功申请试用没有必然联系，对此您完全理解，并同意以您收到的通知信息作为您申请试用是否成功的唯一判断标准。</b></p>
                <p>4.2 您应在申请试用过程中仔细阅读领用的提示内容，根据提示如实提供相关信息，<b>您确认您提供的相关信息由您直接提供，用于南屋北舍向您发放试用品。如因为您提供的信息不实、错误、遗漏等原因，造成南屋北舍无法或无法及时向您提供试用品、提供错误的试用品、提供的试用品被拒签或遗失、拒绝您再次领用试用品等情形时，南屋北舍不承担任何责任。</b></p>
                <p>4.3 一旦您申请试用成功，南屋北舍将承担您在中国大陆境内的试用品寄送邮费。<b>如您的收货地址为港澳台或海外地区，则您应当承担相应的邮费差价</b>，您应在申请试用页面提示的时间内或您与南屋北舍协商一致的时间内完成付款。您成功支付运费但因付款时间超期而导致试用品未领用成功的，南屋北舍将在领用期间结束后十个工作日内向您退还该笔运费，除此之外，南屋北舍无需为此承担任何责任。</p>
            </div>
            <div class="item">
                <h1>第五条 审核申请</h1>
                <p>5.1 <b>您同意</b>，<b>南屋北舍试用中心有权对您是否符合试用申请条件作出独立判断并决定是否接受您的试用申请。</b></p>
                <p>5.2 若您试用申请成功，南屋北舍将向您发送成功申请的确认信息至您预留的手机或邮箱。</p>
            </div>
            <div class="item">
                <h1>第六条 试用品的收取使用</h1>
                <p>6.1 若您成功申请到试用品，则：</p>
                <p>6.1.1 南屋北舍将在领用期间届满之日起七个工作日内向您发送试用品，您可与南屋北舍协商确定其他发送试用品的时间，本项时间合称为发货时间。</p>
                <p>6.1.2 南屋北舍在发货时间内向您发送试用品时，您应自行或委托第三人协助收货，您委托第三人收货的，应在南屋北舍发货前告知南屋北舍。</p>
                <p>6.1.3 试用品送达您指定地点时，如果收货人不是您本人或您委托的第三人，南屋北舍有权选择是否同意物流公司交付试用品，不论南屋北舍做出何种选择，均视为南屋北舍已完成其交付试用品的义务。</p>
                <p>6.1.4 如因为您没有履行收货义务，导致南屋北舍在支付正常的发货运费之外增加费用（包括但不限于保管费、回程运费等），南屋北舍有权要求您承担该费用。</p>
                <P>6.1.5 在签收时，您应对试用品表面一致性进行确认。一旦您完成了签收，您不得对试用品的表面一致问题提出异议。</P>
                <P><b>6.1.6 试用品严禁再进行任何二手、转卖、变相出售等行为，一经发现，您将被取消在南屋北舍试用中心再次申请试用的资格。</b></P>
                <p><b>6.1.7 您确认，您自愿承担试用品质量、物流、设计缺陷等风险， 您所申请的试用品非以现金或通过其他支付行为购买所得，故试用品非商品，您也非消费者，不享受《中华人民共和国消费者权益保护法》7天包退、14天包换等未列举的义务服务，但您有义务将试用品的缺陷、问题及时反馈给南屋北舍。</b></p>
            </div>
            <div class="item">
                <h1>第七条 试用报告 </h1>
                <p>7.1 在使用试用品后，您应按照南屋北舍试用中心的提示在指定页面反馈您的试用报告。</p>
                <p>7.2 在您提交试用报告之前，请您充分阅读、理解并同意下列事项:  </p>
                <p>7.2.1 您应确保您的报告与事实相符，系您独立撰写，且不得做出虚假报告，否则南屋北舍有权追究您的责任。</p>
                <p>7.2.2 南屋北舍有权根据您的报告情况，决定您是否可以继续领用试用品。您理解并同意，您在下次领用南屋北舍提供的试用品时，即便您符合南屋北舍公示在试用中心的领用条件，您仍可能因您的报告情况等原因，被拒绝领用。</p>
                <p>7.2.3 您应主动按照真实的、没有任何后期处理的方式完成试用报告，<b>您理解并同意在申请试用品的同时，承诺试用报告（包括但不限于文字、图片、肖像照片等）无偿提供给南屋北舍使用。南屋北舍对您的试用报告享有二次使用、商业化应用的权利。</b></p>
                <p><b>7.2.4 您确认，您授权南屋北舍可以任何方式使用您撰写的试用报告，使用权包含但不限于：在互联网或其他传播媒介、场合使用试用报告的整体或部分内容（如文字、图片、肖像照片等），授权他人使用试用报告的整体或部分，对试用报告中涉及不安全的信息、非真实的信息进行随时编辑、修改、删除等。</b></p>
            </div>
            <div class="item">
                <h1>第八条 协议终止</h1>
                <p>8.1 本协议在符合以下任意一项情形时终止：</p>
                <p>8.1.1 自然终止：如您在线签署的《南屋北舍平台服务协议》因任何原因终止，则本协议将同时终止；</p>
                <p>8.1.2 通知解除：南屋北舍可提前15天以书面通知的方式终止本协议而无须承担任何责任；</p>
                <p>8.1.3 单方解除权：您违反本协议中的任何承诺或保证，包括但不限于本协议项下的任何约定，南屋北舍有权立刻终止本协议，且按有关规则对您进行处理；</p>
                <p>8.1.4 本协议规定的其它协议终止条件发生或实现，导致本协议终止。</p>
                <p>8.2 无论本协议因何原因终止，在协议终止前的行为所导致的任何责任，您必须完全且独立地承担。</p>
            </div>
            <div class="item">
                <h1>第九条 诉讼管辖</h1>
                <p>因本协议产生之任何争议，应由您与南屋北舍友好协商解决；双方无法协商一致的，应提交南屋北舍所在地有管辖权的人民法院裁决。</p>
            </div>`
        }
      },
      created(){
//        this.$nextTick(function () {
//          this.scroll = new BScroll(this.$refs.scrollContent,{
//            click:true
//          })
//        })
        let _this = this
        _this.$nextTick(function () {
          let wrapper = _this.$refs.scrollContent;
          let touchstartY;
          wrapper.addEventListener( 'touchstart', function (ev) {
            let events = ev.touches[ 0 ] || ev;
            touchstartY = events.clientY;
          }, false );

          wrapper.addEventListener( 'touchmove', function (ev) {
            let events = ev.touches[ 0 ] || ev;
            let scrollTop = wrapper.scrollTop;
            let	offsetHeight = wrapper.offsetHeight;
            let	scrollHeight = wrapper.scrollHeight;
            if ( events.clientY > touchstartY && (wrapper.scrollTop === 0) ) {
              // 下拉时并且页面已经到顶部时
              ev.preventDefault();
            } else if ( events.clientY < touchstartY && (scrollTop + offsetHeight >= scrollHeight) ) {
              // 上拉时并且页面已经到底部时
              ev.preventDefault();
            }
          }, false );
        })
      },
      updated () {
//          this.scroll.scrollTo(0,0)
//          this.scroll.refresh()
      },
      computed: mapState({
        htmlData : function (state) {
          let _this = this
          return _this[state.htmlData]
        }
      }),
      methods:{
        ...mapMutations(['CLOSECONTENT'])
      }
    }
</script>

<style lang="less" type="text/less" rel="stylesheet/less">
  .contentBox{
    position: fixed;
    width: 100%;
    height: 100%;
    left: 0;
    top:0;
    background-color: rgba(0,0,0,0.8);
    backdrop-filter:blur(2px);
    z-index: 1000;
    &.fade-enter-active, &.fade-leave-active {
      transition: opacity .5s
    }
    &.fade-enter, &.fade-leave-active {
      opacity: 0
    }
    .close{
      position: absolute;
      right: 0.2rem;
      top:0.2rem;
      width: 0.5rem;
      height: 0.5rem;
      color: #fff;
      background-color: #FF434C;
      border-radius: 50%;
      text-align: center;
      z-index: 100;
      font-weight: bold;
      font-size: 0.5rem;
      line-height: 0.4rem;
    }
    .scroll-content{
      position: absolute;
      top:0.4rem;
      bottom: 0.4rem;
      left: 0.4rem;
      right: 0.4rem;
      background-color: #fff;
      border-radius: 4px;
      color: #6C6D6F;
      overflow: auto;
      -webkit-overflow-scrolling: touch;
      z-index: 10;
      .scroll{
        .marginBox{
          padding: 0.3rem;
          b{
            font-weight: bold;
          }
          .item{
            margin-bottom: 0.15rem;
          }
          h1{
            line-height: 1.8em;
            font-weight: bold;
            margin-top: 0.1rem;
          }
          p{
            line-height: 1.6em;
            text-indent: 2em;
          }
          h3{
            text-indent: 0;
            font-weight: bold;
            margin-bottom: 0.1rem;
          }
          h4{
            text-indent: 0;
            text-align: center;
            font-weight: bold;
            font-size: 0.28rem;
            margin-bottom: 0.4rem;
          }
        }
      }
    }
  }
</style>
